[
  "dataview",
  "obsidian-image-auto-upload-plugin",
  "sheets",
  "table-editor-obsidian",
  "obsidian-emoji-toolbar",
  "tag-wrangler",
  "obsidian-banners",
  "obsidian-style-settings",
  "obsidian-excalidraw-plugin",
  "file-explorer-note-count",
  "obsidian-icon-folder",
  "obsidian-minimal-settings",
  "obsidian-git",
  "cm-chs-patch",
  "obsidian-pangu",
  "obsidian-linter",
  "better-fn",
  "better-word-count",
  "easy-typing-obsidian"
]