[
  "dataview",
  "obsidian-image-auto-upload-plugin",
  "sheets",
  "table-editor-obsidian",
  "obsidian-emoji-toolbar",
  "tag-wrangler",
  "obsidian-banners",
  "obsidian-style-settings",
  "obsidian-excalidraw-plugin",
  "dida-sync",
  "file-explorer-note-count",
  "heatmap-calendar",
  "obsidian-icon-folder",
  "obsidian-minimal-settings"
]